app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    render json: { posts: Post.all }

INSERT INTO "posts" ("title", "categories", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    post_params
    @post = Post.new(post_params)

    if @post.save