app/controllers/users_controller.rb

  def create
    @user = User.first_or_create(post_params)

    if @user.save
---
INSERT INTO "users" ("name", "token", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["token", "RVdgRzv1Cm4nGtpBbdNLT4VU"], ["updated_at", 2017-04-04 18:33:21 UTC], ["id", 13]]